In [1]:
import pandas as pd

In [5]:
data = pd.read_csv('employee.csv')
data.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [6]:
# GroupBy
# univariate analysis -- single column study
# bivariate analysis -- two columns study
# multivariate analysis -- more than two columns

In [10]:
data.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeCount',
       'EmployeeNumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TotalWorkingYears', 'TrainingTimesLastYear', 'WorkLifeBalance',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YearsWithCurrManager'],
      dtype='object')

In [13]:
data["Attrition"].unique()

array(['Yes', 'No'], dtype=object)

In [14]:
data["Attrition"].value_counts() # mode

Attrition
No     1233
Yes     237
Name: count, dtype: int64

In [15]:
data["Age"].mean()

36.923809523809524

In [16]:
data["Age"].median()

36.0

In [17]:
# return the mean age of employees according to their department.
# syntax - data.group(categorical)[Numerical].mean(), max, median
data.groupby("Department")["Age"].mean()

Department
Human Resources           37.809524
Research & Development    37.042664
Sales                     36.542601
Name: Age, dtype: float64

In [18]:
# # return the mean age of employees according to their EducationField.
data.groupby("EducationField")["Age"].mean()

EducationField
Human Resources     37.037037
Life Sciences       37.107261
Marketing           37.924528
Medical             36.838362
Other               35.365854
Technical Degree    36.121212
Name: Age, dtype: float64

In [20]:
# return the mean of MonthlyIncome according to gender.
data.groupby("Gender")["MonthlyIncome"].mean()

Gender
Female    6686.566327
Male      6380.507937
Name: MonthlyIncome, dtype: float64

In [22]:
data.groupby("Gender")["EducationField"].value_counts()

Gender  EducationField
Female  Life Sciences       240
        Medical             190
        Marketing            69
        Technical Degree     52
        Other                29
        Human Resources       8
Male    Life Sciences       366
        Medical             274
        Marketing            90
        Technical Degree     80
        Other                53
        Human Resources      19
Name: count, dtype: int64

In [23]:
# Multivariate -----
# mean TotalWorkingYears with respect to Gender and Department
data.groupby(["Gender", "Department"])["TotalWorkingYears"].mean()

Gender  Department
Female  Human Resources           11.400000
        Research & Development    11.870712
        Sales                     11.470899
Male    Human Resources           11.627907
        Research & Development    10.998282
        Sales                     10.836576
Name: TotalWorkingYears, dtype: float64

In [24]:
# # mean TotalWorkingYears, MonthlyIncome with respect to Gender and Department
data.groupby("Gender")[["TotalWorkingYears","MonthlyIncome"]].mean()

        TotalWorkingYears  MonthlyIncome
Gender
Female          11.726190    6686.566327
Male            10.981859    6380.507937